{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 5, "nb_filter": 24, "nb_row": 5, "batch_input_shape": [null, 200, 100, 3], "name": "conv1_1", "input_dtype": "float32", "border_mode": "valid", "b_constraint": null, "activation": "relu", "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 5, "nb_filter": 36, "nb_row": 5, "name": "conv2_1", "border_mode": "valid", "b_constraint": null, "activation": "relu", "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 5, "nb_filter": 48, "nb_row": 5, "name": "conv3_1", "border_mode": "valid", "b_constraint": null, "activation": "relu", "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 64, "nb_row": 3, "name": "conv4_1", "border_mode": "valid", "b_constraint": null, "activation": "relu", "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 64, "nb_row": 3, "name": "conv4_2", "border_mode": "valid", "b_constraint": null, "activation": "relu", "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "name": "dense_0", "b_constraint": null, "activation": "relu", "activity_regularizer": null, "bias": true, "input_dim": 5760, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1164}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "name": "dense_1", "b_constraint": null, "activation": "relu", "activity_regularizer": null, "bias": true, "input_dim": 1164, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 100}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "name": "dense_2", "b_constraint": null, "activation": "relu", "activity_regularizer": null, "bias": true, "input_dim": 100, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "name": "dense_3", "b_constraint": null, "activation": "relu", "activity_regularizer": null, "bias": true, "input_dim": 50, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 10}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "name": "dense_4", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "bias": true, "input_dim": 10, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1}}], "keras_version": "1.2.1"}