{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "input_dtype": "float32", "nb_col": 5, "name": "conv1_1", "subsample": [2, 2], "bias": true, "b_regularizer": null, "nb_filter": 24, "batch_input_shape": [null, 200, 100, 3], "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "name": "conv2_1", "subsample": [2, 2], "activation": "relu", "b_regularizer": null, "nb_filter": 36, "b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "name": "conv3_1", "subsample": [2, 2], "activation": "relu", "b_regularizer": null, "nb_filter": 48, "b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "name": "conv4_1", "subsample": [1, 1], "activation": "relu", "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "name": "conv4_2", "subsample": [1, 1], "activation": "relu", "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": 5760, "activation": "relu", "output_dim": 1164, "b_regularizer": null, "bias": true, "name": "dense_0", "trainable": true, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": 1164, "activation": "relu", "output_dim": 100, "b_regularizer": null, "bias": true, "name": "dense_1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": 100, "activation": "relu", "output_dim": 50, "b_regularizer": null, "bias": true, "name": "dense_2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": 50, "activation": "relu", "output_dim": 10, "b_regularizer": null, "bias": true, "name": "dense_3", "trainable": true, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": 10, "activation": "linear", "output_dim": 1, "b_regularizer": null, "bias": true, "name": "dense_4", "trainable": true, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}]}