{"config": [{"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "name": "conv1_1", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 300, 100, 3], "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "W_regularizer": null, "input_dtype": "float32", "trainable": true, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"name": "conv2_1", "bias": true, "W_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "W_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "conv3_1", "bias": true, "W_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "W_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "conv4_1", "bias": true, "W_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "W_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "conv4_2", "bias": true, "W_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "W_regularizer": null, "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 9600, "bias": true, "name": "dense_0", "W_constraint": null, "b_constraint": null, "output_dim": 1164, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dim": 1164, "bias": true, "name": "dense_1", "W_constraint": null, "b_constraint": null, "output_dim": 100, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 100, "bias": true, "name": "dense_2", "W_constraint": null, "b_constraint": null, "output_dim": 50, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 50, "bias": true, "name": "dense_3", "W_constraint": null, "b_constraint": null, "output_dim": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 10, "bias": true, "name": "dense_4", "W_constraint": null, "b_constraint": null, "output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true}}], "keras_version": "1.2.1", "class_name": "Sequential"}