{"keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [2, 2], "bias": true, "nb_filter": 24, "batch_input_shape": [null, 300, 100, 3], "b_regularizer": null, "border_mode": "valid", "activation": "relu", "nb_col": 5, "nb_row": 5, "trainable": true, "input_dtype": "float32", "W_constraint": null, "name": "conv1_1", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [2, 2], "bias": true, "nb_filter": 36, "b_regularizer": null, "border_mode": "valid", "activation": "relu", "nb_col": 5, "nb_row": 5, "trainable": true, "W_constraint": null, "name": "conv2_1", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [2, 2], "bias": true, "nb_filter": 48, "b_regularizer": null, "border_mode": "valid", "activation": "relu", "nb_col": 5, "nb_row": 5, "trainable": true, "W_constraint": null, "name": "conv3_1", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "activation": "relu", "nb_col": 3, "nb_row": 3, "trainable": true, "W_constraint": null, "name": "conv4_1", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "activation": "relu", "nb_col": 3, "nb_row": 3, "trainable": true, "W_constraint": null, "name": "conv4_2", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "relu", "input_dim": 9600, "W_constraint": null, "name": "dense_0", "b_constraint": null, "init": "glorot_uniform", "output_dim": 1164, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "relu", "input_dim": 1164, "W_constraint": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "output_dim": 100, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "relu", "input_dim": 100, "W_constraint": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "output_dim": 50, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "relu", "input_dim": 50, "W_constraint": null, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "linear", "input_dim": 10, "W_constraint": null, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform", "output_dim": 1, "activity_regularizer": null}}], "class_name": "Sequential"}